<template>
  <div class="container">
      포트폴리오 웹페이지를 Vue를 통해 구현하면서...
      이 사이트 이전에 습작으로 만들었던 리액트로 만든 포트폴리오 원본 소스를 날려버렸다 ^_______^
      깃에는 빌드된 파일만 올렸기에 복구가 불가능했다..
      그래서 새로 만드는 겸 디자인도 새로 변경해보고 매번 새로운 난관에 부딪히는 리액트는 잠시 내려두고
      조금 쉽다는 Vue.js를 활용해서 만들어보기로 했다.
      vuetify라는 디자인 프레임워크로 만들면 금방 만들겠지만 금방 만들기전에 문서보고 옵션넣고 하는것보단 
      그냥 내가 직접 스타일 짜는게 더 빨라 보였다.
      작업을 하면서 이번에는 sass도 사용해보고 firebase 기능 중 호스팅 리얼타임 디비도 해보고 그동안 마음속에만 넣어두었던 기술들을 다 꺼내보았다
      물론 대형 프로젝트가 아니어서 많은 기술이 나오긴 어려웠지만 아 이맛이구나 하는 정도의 맛만 보았다.
      앵귤러 리액트 뷰 모두 자바스크립트 기반의 언어인지라 비슷해보이면서도 뷰 이놈은 좀 쉬웠다
      파이어베이스에 호스팅하고 리얼 디비도 사용해보니 역시 인력과 자본의 힘은 엄청나구나..를 또 느끼게 된다
  </div>
</template>
